In [30]:
import pandas as pd

In [31]:
data = {"name":["Tarun","Milan","Yash","Veer","Tarun","Milan"], "English":[100,99,92,92,100,95],"Science":[97,97,92,91,97,97]}

In [32]:
df = pd.DataFrame(data)
df

    name  English  Science
0  Tarun      100       97
1  Milan       99       97
2   Yash       92       92
3   Veer       92       91
4  Tarun      100       97
5  Milan       95       97

In [33]:
# df["Duplicates"] = df.duplicated()
# df

In [34]:
df.drop_duplicates(inplace=True)

In [35]:
df

    name  English  Science
0  Tarun      100       97
1  Milan       99       97
2   Yash       92       92
3   Veer       92       91
5  Milan       95       97

In [36]:
dataset = pd.read_csv("carsales.csv")

In [38]:
dataset.shape

(1000, 5)

In [39]:
dataset.drop_duplicates(inplace=True)

In [40]:
dataset.shape

(999, 5)